utilizando mermaid nos diagramas
